<?php
require('src/php/head.php');
?>
<?php
require('src/php/header.php');
?>

<body>
  <main>
    <section class="section-wrapper">

      <!-- ポートフォリオタイトル -->
      <div class="section_title">
        <h2 class="section_title-words">コーポレートサイト<br class="indent">「オフィスプロ」</h2>
      </div>
      <!-- //ポートフォリオタイトル -->

      <!-- サイト画面 -->
        <img src="dist/img/officepro.png" alt="ポートフォリオサイト「オフィスプロ」の写真">
      <!-- //サイト画面 -->

      <!-- サイトリンク -->
      <button class="link-button">
        <a href="https://asa-works.com/officepro/" target="_blank">Webサイトを見る</a>
      </button>
      <button class="link-button">
        <a href="https://github.com/asa8831/officepro" target="_blank">GitHubを見る</a>
      </button>
      <!-- //サイトリンク -->

      <!-- 説明部分 -->
      <h2 class="heading">サイト概要</h2>
      <p>「オフィス機器やオフィススペースの貸し出し、販売等、オフィス関係のビジネスを行っている会社のコーポレートサイト」というイメージで作成しました。</p>
      <h2 class="heading">作成に至った経緯</h2>
      <p>コロナ禍により対面してビジネスを行うことが以前よりも難しくなったため、会社の情報をわかりやすく発信する魅力的なコーポレートサイトがあれば集客に結びつくのではないかと予測し、作成するに至りました。

</p>
      <h2 class="heading">製作期間</h2>
      <p>4営業日(26.5時間)</p>
      <h2 class="heading">使用言語 / 開発環境</h2>
      <p>MacOS(Catalina)、HTML5、CSS3、jQuery(3.5.1)</p>
      <p>Google Chrome、Safari、Firefox、Microsoft Edge、iPhone7で実機確認済み</p>
      <h2 class="heading">レスポンシブ</h2>
      <p>対応済み</p>
      <h2 class="heading">取り組むにあたり望んだ姿勢</h2>
      <p>事前に色々な企業のページを見て、「コーポレートサイトらしさ」をどうすればだせるのか考えた上で作成に取り掛かりました。</p>
      <h2 class="heading">やってみて感じたこと</h2>
      <p>事前に計画立てて取り組んでいくことの大切さを痛感しました。<br>初めてレスポンシブ対応のページを作成しましたが、PC用画面作成の段階である程度レスポンシブのことを考えながら組んでいけば、携帯用画面に切り替えたときに大きくレイアウトが崩れることはなく、考えていたよりも短い製作期間で作成が完了しました。<br>作成の早さや品質はお客様の信頼に直結する部分なので、やみくもに取り組むのではなく、計画立てを大切にしながら今後も仕事を進めていきます。</p>
      <h2 class="heading">苦労した部分</h2>
      <p>画面右脇に「topに戻るボタン」を実装した際に、「ボタンが急に点滅しだす」「topに戻ったときに、一定時間スクロールが効かなくなる」という２点の不具合が起き、解消するのに苦労しました。<br>不具合の原因はそれぞれにあると仮説立てていましたが、結局原因は１つであり、個別に原因があると考えていただけに驚愕しました。<br>このことから、エラーが複数個同時に起きた場合も、落ち着いて１つずつ取り組んでいくことが一番の近道だということを、身に染みて感じました。（解消までの経緯について詳しくは<a href="https://yuzuichiban0331.hatenablog.com/entry/2020/09/17/000000" class="link-pink" target="_blank">ブログ参照</a>。）</p>
      <h2 class="heading">こだわった部分</h2>
      <p>ビジネス用のサイトのため、「素早くスマートな会社」というイメージを見た人に与えられるようにしたいと考えました。<br>それを実現するため<br>①スッキリとした印象を与えるよう、青と白を基調としたこと<br>②「欲しい情報にすぐにたどり着く」を目指し、トップページに載せる情報を最低限にし、詳しい情報へのリンクを大きめに表示したこと<br>③jQueryやCSSアニメーションで動きをつけた部分は、スピーディーに動くよう調整したこと<br>の３点を盛り込んだことが、今回こだわった部分として挙げられます。</p>
      <h2 class="heading">今後の課題として取り組んでいきたいこと</h2>
      <p>今回参考のために様々な会社のコーポレートサイトを見た結果、コーポレートサイトと一口に言っても、会社によってスタイルは様々だということがわかりました。<br>ただ、「〇〇業界らしさ」のようなものはそれぞれのサイトから感じられたため、サイトを作る際は「らしさ」を意識して作ることが大切なのではないかと思いました。<br>今はまだこの「らしさ」の傾向がはっきりとわかっていないため、既存のサイトを数多く研究し、参考にしながら製作を行っていきたいです。<p>
      <!-- 説明部分 -->

      <button class="link-button">
        <a href="https://asa-works.com/top/#works">戻る</a>
      </button>
    </section>

  </main>


  <?php
  require('src/php/footer.php');
  ?>